# Missing Data

In [4]:
import numpy as np
import pandas as pd

In [8]:
df=pd.DataFrame({'A':[1,2,np.nan],
                 'B':[5,np.nan,np.nan],
                 'C':[1,2,3]})

In [10]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [14]:
#to drop nan - it vanish all not a number columns
df.dropna()

     A    B  C
0  1.0  5.0  1

In [16]:
#to drop column wise
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [18]:
#we can accept any nan - threshold - it accept one not a number
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [20]:
df.fillna(value='***')

     A    B  C
0  1.0  5.0  1
1  2.0  ***  2
2  ***  ***  3

In [24]:
#for example in age missing data dound actually we fill mean value by fillna
#if we dropna - it may leads to loss of data
#if we fillna - by mean like statistical functions

In [26]:
df['B'].fillna(value=df['C'])

0    5.0
1    2.0
2    3.0
Name: B, dtype: float64

In [28]:
df['C'].mean()

2.0

### Group By

In [34]:
#aggregate - usefull - groupby - total

In [40]:
data={
    'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
    'person':['sam','charlie','amy','vanessa','carl','sarah'],
    'sales':[200,120,340,124,243,350]
}

In [44]:
df=pd.DataFrame(data)

In [60]:
df

  company   person  sales
0    GOOG      sam    200
1    GOOG  charlie    120
2    MSFT      amy    340
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350

In [71]:
a=df.groupby('company') #is does not return anything - we have to aggregate

In [73]:
a.mean(numeric_only=True)

         sales
company
FB       296.5
GOOG     160.0
MSFT     232.0

In [77]:
a.std(numeric_only=True)

              sales
company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [79]:
a.min()

          person  sales
company
FB          carl    243
GOOG     charlie    120
MSFT         amy    124

In [81]:
a.max()

          person  sales
company
FB         sarah    350
GOOG         sam    200
MSFT     vanessa    340

In [83]:
a.count()

         person  sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [85]:
#important - describe - it shows all

In [87]:
a.describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [89]:
df.groupby('company').describe()

        sales
        count   mean         std    min     25%    50%     75%    max
company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0